# Taps
tap 'buo/cask-upgrade'                  # for upgrading casks
tap 'shivammathur/php'                  # for php
tap 'shivammathur/extensions'           # for php-extensions
tap 'koekeishiya/formulae'              # for skhd
tap 'nicoverbruggen/homebrew-cask'      # for phpmon

# Binaries
brew 'antigen'              # zsh plugins manager
brew 'bat'                  # cat on steroids
brew 'btop'                 # cli activity monitor
brew 'cmake'
brew 'coreutils'            # Those that come with macOS are outdated
brew 'curl'
brew 'd2'                   # diagram language
brew 'diff-so-fancy'        # git diff tool
brew 'eza'                  # ls replacement
brew 'fastfetch'            # neofetch replacement
brew 'ffmpeg'
brew 'fzf'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'jq'
brew 'less'
brew 'mackup'               # backup app settings
brew 'mas'                  # Mac App Store manager
brew 'mpv'                  # media player
brew 'ollama'               # cli for running LLM locally
brew 'openssl'
brew 'pkg-config'           # needed for imagick build/install
brew 'koekeishiya/formulae/skhd'                 # hotkey daemon
brew 'viu'                  # terminal image viewer
brew 'xh'                   # httpie replacement, cli http client
brew 'yt-dlp'               # youtube-dl fork
brew 'zoxide'               # better cd

# Development
brew 'frum'                 # ruby version manager
brew 'imagemagick'
brew 'jenv'                 # java version manager
brew 'mailpit'              # mail catcher
brew 'meilisearch'
brew 'nvim'
brew 'nvm'
brew 'php'
brew 'pyenv'
brew 'sqlite'
brew 'starship'             # zsh prompt
brew 'vim'

# Fonts
cask 'font-annotation-mono'
cask 'font-fantasque-sans-mono-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-monaspace'
cask 'font-noto-sans'
cask 'font-noto-sans-bengali'
cask 'font-noto-sans-bengali-ui'
cask 'font-noto-serif-bengali'
cask 'font-sauce-code-pro-nerd-font'
cask 'font-computer-modern'

# Apps
cask '1password'
cask 'aldente'              # charging controller app
cask 'bartender'
cask 'bruno'                # api client
cask 'dbngin'               # mysql, postgresql, redis
cask 'ghostty'              # terminal
cask 'google-chrome'
cask 'imageoptim'
cask 'iina'                 # media player
cask 'latest'               # tool to check for latest releases
cask 'monitorcontrol'       # control external monitor settings
cask 'obsidian'
cask 'orbstack'             # docker replacement
cask 'phpmon'               # php/valet monitoring tool
cask 'raycast'              # spotlight replacement
cask 'visual-studio-code'
cask 'yt-music'

# Mac App Store
mas 'Amphetamine', id: 937984704
mas 'Dato', id: 1470584107
mas 'Keynote', id: 409183694
mas 'Messenger', id: 1480068668    # facebook messenger
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'pap.er', id: 1639052102       # great wallpapers
mas 'The Unarchiver', id: 425424353
mas 'WhatsApp', id: 310633997
mas 'Xcode', id: 497799835
