# Taps
tap 'homebrew/bundle'

# Binaries
brew 'bat'                  # cat on steroids
brew 'btop'                 # cli activity monitor
brew 'cmake'
brew 'coreutils'            # Those that come with macOS are outdated
brew 'curl'
brew 'd2'                   # diagram language
brew 'eza'                  # ls replacement
brew 'ffmpeg'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'               # cli http client
brew 'jq'
brew 'mackup'               # backup app settings
brew 'mas'                  # Mac App Store manager
brew 'openssl'
brew 'php'
brew 'pkg-config'           # needed for imagick build/install
brew 'yt-dlp'               # youtube-dl fork
brew 'zoxide'               # better cd

# Development
brew 'antigen'              # zsh plugins manager
brew 'frum'                 # ruby version manager
brew 'fzf'
brew 'imagemagick'
brew 'jenv'                 # java version manager
brew 'mailpit'              # mail catcher
brew 'meilisearch'
brew 'nvim'
brew 'nvm'
brew 'pyenv'
brew 'sqlite'
brew 'starship'             # zsh prompt
brew 'vim'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-monaspace'
cask 'font-noto-sans'
cask 'font-noto-sans-bengali'
cask 'font-noto-sans-bengali-ui'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-computer-modern'

# Apps
cask '1password'
cask 'aldente'              # charging controller app
cask 'bartender'
cask 'bruno'                # api client
cask 'command-x'            # cut and paste functionality
cask 'dbngin'               # mysql, postgresql, redis
cask 'docker'
cask 'ghostty'              # terminal
cask 'google-chrome'
cask 'imageoptim'
cask 'iina'                 # media player
cask 'jetbrains-toolbox'
cask 'latest'               # tool to check for latest releases
cask 'obsidian'
cask 'pearcleaner'
cask 'raycast'              # spotlight replacement
cask 'swish'                # window snapping tool
cask 'visual-studio-code'
cask 'yt-music'

# Mac App Store
mas 'Amphetamine', id: 937984704
mas 'Keynote', id: 409183694
mas 'Messenger', id: 1480068668    # facebook messenger
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'pap.er', id: 1639052102       # great wallpapers
mas 'The Unarchiver', id: 425424353
mas 'Xcode', id: 497799835
